---
kind: property
id: P:Autodesk.Revit.DB.IFC.ExporterIFC.WallAndColumnSplitting
source: html/860fc0ad-a272-4cdd-9e0a-d360a492900d.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.WallAndColumnSplitting Property

Identifies if division of multi-level walls and columns by levels should take place during this export.

## Syntax (C#)
```csharp
public bool WallAndColumnSplitting { get; }
```